app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY "movies"."title" ASC
---
    <tr>
      <th id="title_header" class="hilite <%=@title_highlight%>"> <%= link_to 'Movie Title', movies_path({:title_clicked => true, :ratings => Hash[@ratings_to_show.map {|x| [x, 1]}] }) %> </th>